ProgessBase/Documents/ВыбытиеОсновныхСредствМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВыбытиеОсновныхСредствМеждународный</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОсновныеСредстваМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ОперацииВыбытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ВидыОперацийВыбытиеОС_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестонахождениеОбъекта</Name>
							<Comment>Подразделение организации, в котором находится объект ОС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестонахождениеОбъектаНов</Name>
							<Comment>Подразделение организации, в котором находится объект ОС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛНов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыбытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовРасходов</Name>
							<Comment>Счет учета, в дебет которого списывается остаток первоначальной стоимости ОС</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Субконто первого уровня счета, в дебет которого относится амортизация</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Субконто второго уровня счета, в дебет которого относится амортизация</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Субконто третьего уровня счета, в дебет которого относится амортизация</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДС_Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДС_Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьКСписанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияКСписанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/УчетнаяПолитикаМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаМеждународныйУчет</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчетаДанныхВновьПриобретенныхКомпаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРасчетаДанныхВновьПриобретенныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодУчетаИнвестиционнойСобственности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодАмортизацииНМА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОпределенияПроцентаВыполненияДоговораПодряда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОпределенияПроцентаВыполненияДоговораПодряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОценкиОсновныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПереоценкиОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыПереоценкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетВыбытияОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ОсновныеСредстваМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеСредстваМеждународныйУчет</Name>
			<Comment>(Упр) Сведения об объектах ОС  для целей международного учета</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, на балансе которой учитывется объект ОС в международном учете</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Comment>Дата принятия объекта к международному учету</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестонахождениеОбъекта</Name>
					<Comment>Подразделение организации, в котором находится объект ОС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Comment>Счет учета в плане счетов Международный</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Comment>Срок полезного использования в месяцах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Comment>Булево - начиляется амортизация или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации по международному учету</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияАмортизацииОСМеждународный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Comment>Счет, на котором накапливается начисленная амортизация</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная (историческая) стоимость объекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СправедливаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Comment>Стоимость, которая должна остаться после истечения срока полезного использования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Comment>Счет учета, в дебет которого относятся амортизационные отчисления</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Comment>Субконто первого уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Comment>Субконто второго уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Comment>Субконто третьего уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредполагаемыйОбъемПродукции</Name>
					<Comment>Используется при амортизации пропорционально объему продукции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНачисленнойАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УбытокОтОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСниженияСтоимости</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ис_Лизинг</Name>
					<Comment>ОС находится в лизинге</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ДС_ВидыОперацийВыбытиеОС_МСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДС_ВидыОперацийВыбытиеОС_МСФО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбычноеВыбытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ВыбытиеОсновныхСредствМеждународный/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	//начало изменений ДС МСФО 09.12.2013
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаМеждународныйУчет.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	Если НЕ ЗначениеЗаполнено(УчетнаяПолитика.СчетВыбытияОС) Тогда
		Сообщить("Не указан счет выбытия ОС в учетной политике (международный учет)!", СтатусСообщения.Внимание);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// is ЯннуровВФ нач 20140523 ЗР-0И-001239
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТабЧасть.ОсновноеСредство
	//|ИЗ
	//|	Документ.ВыбытиеОсновныхСредствМеждународный.ОсновныеСредства КАК ТабЧасть
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
	//|				&Дата,
	//|				Организация = &Организация
	//|					И Регистратор <> &Ссылка) КАК РегСвед
	//|		ПО ТабЧасть.ОсновноеСредство = РегСвед.ОсновноеСредство
	//|			И (РегСвед.Состояние = &СнятоСУчета)
	//|			И (ТабЧасть.Ссылка = &Ссылка)";
	//
	//Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	//Запрос.УстановитьПараметр("Дата", 			КонецДня(Дата));
	//Запрос.УстановитьПараметр("Организация", 	Организация);
	//Запрос.УстановитьПараметр("СнятоСУчета", 	Перечисления.ВидыСостоянийОС.СнятоСУчета);
	//Результат = Запрос.Выполнить();
	//
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Сообщить("Основное средство [" + Выборка.ОсновноеСредство + "] уже снято с учета!", СтатусСообщения.Внимание);
	//	Отказ = Истина;
	//КонецЦикла;
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыбытиеОсновныхСредствМеждународныйОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.ВыбытиеОсновныхСредствМеждународный.ОсновныеСредства КАК ВыбытиеОсновныхСредствМеждународныйОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&Дата, Регистратор <> &Ссылка) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ПО ВыбытиеОсновныхСредствМеждународныйОсновныеСредства.ОсновноеСредство = ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	ВыбытиеОсновныхСредствМеждународныйОсновныеСредства.Ссылка = &Ссылка
	|	И ОсновныеСредстваМеждународныйУчетСрезПоследних.ис_Лизинг = &Лизинг
	|	И ОсновныеСредстваМеждународныйУчетСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийОС.СнятоСУчета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство
	|АВТОУПОРЯДОЧИВАНИЕ";
	лЗапрос.УстановитьПараметр("Ссылка", Ссылка);
	лЗапрос.УстановитьПараметр("Дата", КонецДня(Дата));
	лЗапрос.УстановитьПараметр("Лизинг", (ВидОперации=Перечисления.ДС_ВидыОперацийВыбытиеОС_МСФО.Лизинг));
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл 
		Отказ = Истина;
		Сообщить("Основное средство """+лВыборка.ОсновноеСредство+""" уже снято с учета по МСФО", СтатусСообщения.Внимание);
	КонецЦикла;
	// is ЯннуровВФ кон 20140523

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	//конец изменений ДС МСФО 09.12.2013
	
	СчетВыбытиеОС = ПланыСчетов.Международный._ВыбытиеОсновныхСредств;
	
	Для Каждого ТекСтрокаОсновныеСредства Из ОсновныеСредства Цикл
		СрезСведенийМежд = РегистрыСведений.ОсновныеСредстваМеждународныйУчет.ПолучитьПоследнее(Дата, Новый Структура("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство));

		Если Операция <> Перечисления.ДС_ОперацииВыбытияОС.ЧастичнаяЛиквидация Тогда
			// регистр ОсновныеСредстваМеждународныйУчет 
			ДвижениеРС = Движения.ОсновныеСредстваМеждународныйУчет.Добавить();
			//начало изменений ДС МСФО 11.12.2013
			// is ЯннуровВФ нач 20140626
			//ДвижениеРС.Период = ТекСтрокаОсновныеСредства.ДатаВыбытия; //Дата;
			ДвижениеРС.Период = КонецДня(ТекСтрокаОсновныеСредства.ДатаВыбытия); //Дата;
			// is ЯннуровВФ кон 20140626
			//конец изменений ДС МСФО 11.12.2013
			ДвижениеРС.ОсновноеСредство = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			ДвижениеРС.Организация = Организация;
			ДвижениеРС.ДатаПринятияКУчету = СрезСведенийМежд.ДатаПринятияКУчету;
			ДвижениеРС.МестонахождениеОбъекта = ТекСтрокаОсновныеСредства.МестонахождениеОбъектаНов;
			ДвижениеРС.МОЛ = ТекСтрокаОсновныеСредства.МОЛНов;
			ДвижениеРС.СчетУчета = СрезСведенийМежд.СчетУчета;
			ДвижениеРС.СрокПолезногоИспользования = СрезСведенийМежд.СрокПолезногоИспользования;
			ДвижениеРС.МетодНачисленияАмортизации = СрезСведенийМежд.МетодНачисленияАмортизации;
			ДвижениеРС.СчетНачисленияАмортизации = СрезСведенийМежд.СчетНачисленияАмортизации;
			ДвижениеРС.ПервоначальнаяСтоимость = СрезСведенийМежд.ПервоначальнаяСтоимость;
			ДвижениеРС.ЛиквидационнаяСтоимость = СрезСведенийМежд.ЛиквидационнаяСтоимость;
			ДвижениеРС.СчетЗатрат = СрезСведенийМежд.СчетЗатрат;
			ДвижениеРС.Субконто1 = СрезСведенийМежд.Субконто1;
			ДвижениеРС.Субконто2 = СрезСведенийМежд.Субконто2;
			ДвижениеРС.Субконто3 = СрезСведенийМежд.Субконто3;
			ДвижениеРС.ПредполагаемыйОбъемПродукции = СрезСведенийМежд.ПредполагаемыйОбъемПродукции;
			ДвижениеРС.СуммаНачисленнойАмортизации = СрезСведенийМежд.СуммаНачисленнойАмортизации;
			ДвижениеРС.СправедливаяСтоимость = СрезСведенийМежд.СправедливаяСтоимость;
			ДвижениеРС.НачислятьАмортизацию = Ложь;
			ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета; // д.б. НаходитсяВСтадииВыбытия;
			ДвижениеРС.СчетСниженияСтоимости = СрезСведенийМежд.СчетСниженияСтоимости;
			// is ЯннуровВФ нач 20140523 ЗР-0И-001239
			ДвижениеРС.ис_Лизинг = СрезСведенийМежд.ис_Лизинг;
			// is ЯннуровВФ кон 20140523
		КонецЕсли;
		
		// Проверка "хвостов" по "СчетУчета" и "СчетНачисленияАмортизации"
		МассивСчетов = Новый Массив();
		МассивСчетов.Добавить(СрезСведенийМежд.СчетУчета);
		МассивСчетов.Добавить(СрезСведенийМежд.СчетНачисленияАмортизации);
		МассивСчетов.Добавить(СрезСведенийМежд.СчетСниженияСтоимости);
		
		/// Кунов О.В., 17.08.2016 - 53270
		Если Операция = Перечисления.ДС_ОперацииВыбытияОС.ЧастичнаяЛиквидация Тогда
			
			СчетДоходовРасходов = ТекСтрокаОсновныеСредства.СчетДоходовРасходов;
			Если Не ЗначениеЗаполнено(СчетДоходовРасходов) Тогда
				СчетДоходовРасходов = ПланыСчетов.Международный.ПрочиеВнереализационныеРасходы;
				СчетДоходовРасходовСубконто = Неопределено;
			Иначе
				СчетДоходовРасходовСубконто = Новый Массив;
				СчетДоходовРасходовСубконто.Добавить(ТекСтрокаОсновныеСредства.Субконто1);
				СчетДоходовРасходовСубконто.Добавить(ТекСтрокаОсновныеСредства.Субконто2);
				СчетДоходовРасходовСубконто.Добавить(ТекСтрокаОсновныеСредства.Субконто3);
			КонецЕсли;

			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = СчетВыбытиеОС;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			Движение.СчетКт = СрезСведенийМежд.СчетУчета;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			Движение.Сумма = ТекСтрокаОсновныеСредства.СтоимостьКСписанию;
			
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = СрезСведенийМежд.СчетНачисленияАмортизации;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			Движение.СчетКт = СчетВыбытиеОС;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			Движение.Сумма = ТекСтрокаОсновныеСредства.АмортизацияКСписанию;
			
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = СчетДоходовРасходов;
			Для Н = 0 По СчетДоходовРасходов.ВидыСубконто.Количество()-1 Цикл
				ВидСубконто = СчетДоходовРасходов.ВидыСубконто[Н].ВидСубконто;
				Если ЗначениеЗаполнено(СчетДоходовРасходовСубконто) И ЗначениеЗаполнено(СчетДоходовРасходовСубконто[Н]) Тогда
					Движение.СубконтоДт[ВидСубконто] = СчетДоходовРасходовСубконто[Н];
				Иначе
					Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения Тогда
						Движение.СубконтоДт[ВидСубконто] = СрезСведенийМежд.МестонахождениеОбъекта;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Движение.СчетКт = СчетВыбытиеОС;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;			
			Движение.Сумма = ТекСтрокаОсновныеСредства.СтоимостьКСписанию - ТекСтрокаОсновныеСредства.АмортизацияКСписанию;
			
		Иначе
		///
			
			БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
			// is ЯннуровВФ нач 20140626 0И-001239
			//БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , МассивСчетов, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
			БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1",, Новый Граница(КонецДня(Дата), ВидГраницы.Включая), , МассивСчетов, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
			// is ЯннуровВФ кон 20140626
			СуммаДт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", СрезСведенийМежд.СчетУчета, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			СуммаКт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетНачисленияАмортизации, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			СуммаКт1 = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетСниженияСтоимости, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			
			Если СуммаДт <> 0 Тогда
				Движение = Движения.Международный.Добавить();
				Движение.Период = Дата;
				//начало изменений ДС МСФО 09.12.2013
				Движение.СчетДт = УчетнаяПолитика.СчетВыбытияОС; //ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
				//конец изменений ДС МСФО 09.12.2013
				Движение.СчетКт = СрезСведенийМежд.СчетУчета;
				Движение.Организация = Организация;
				Движение.Сумма = СуммаДт;
				//начало изменений ДС МСФО 09.12.2013
				Движение.Содержание = "Списание первоначальной стоимости ОС при выбытии";//"Закрытие счета учета основного средства";
				//конец изменений ДС МСФО 09.12.2013
				Движение.НомерЖурнала = "Рег";
				// is ЯннуровВФ нач 20140602 ЗР-0И-001239
				Если Движение.СчетДт.Количественный Тогда 
					Движение.КоличествоДт = 1;
				КонецЕсли;
				Если Движение.СчетКт.Количественный Тогда 
					Движение.КоличествоКт = 1;
				КонецЕсли;
				// is ЯннуровВФ кон 20140602
				
				Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
				КонецЕсли;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СуммаКт <> 0 Тогда
				Движение = Движения.Международный.Добавить();
				Движение.Период = Дата;
				Движение.СчетДт = СрезСведенийМежд.СчетНачисленияАмортизации;
				//начало изменений ДС МСФО 09.12.2013
				Движение.СчетКт = УчетнаяПолитика.СчетВыбытияОС; //ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
				//конец изменений ДС МСФО 09.12.2013
				Движение.Организация = Организация;
				Движение.Сумма = СуммаКт;
				//начало изменений ДС МСФО 09.12.2013
				Движение.Содержание = "Списание накопленной амортизации"; //"Закрытие счета начисления амортизации основного средства";
				//конец изменений ДС МСФО 09.12.2013
				Движение.НомерЖурнала = "Рег";
				// is ЯннуровВФ нач 20140602 ЗР-0И-001239
				Если Движение.СчетДт.Количественный Тогда 
					Движение.КоличествоДт = 1;
				КонецЕсли;
				Если Движение.СчетКт.Количественный Тогда 
					Движение.КоличествоКт = 1;
				КонецЕсли;
				// is ЯннуровВФ кон 20140602
				
				Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
				КонецЕсли;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
				КонецЕсли;
				
			КонецЕсли;
			
			//начало изменений ДС МСФО 09.12.2013
			//Если СуммаКт1 <> 0 Тогда
			//	Движение = Движения.Международный.Добавить();
			//	Движение.Период = Дата;
			//	Движение.СчетДт = СрезСведенийМежд.СчетСниженияСтоимости;
			//	Движение.СчетКт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
			//	Движение.Организация = Организация;
			//	Движение.Сумма = СуммаКт1;
			//	Движение.Содержание = "Закрытие счета снижения стоимости основного средства";
			//	Движение.НомерЖурнала = "Рег";
			//	
			//	Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
			//		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			//	КонецЕсли;
			//	
			//	Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
			//		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			//	КонецЕсли;
			//	
			//КонецЕсли;
			//конец изменений ДС МСФО 09.12.2013
			
			ОбщаяСуммаКорректировки = СуммаДт - СуммаКт - СуммаКт1;
			
			//начало изменений ДС МСФО 09.12.2013
			Если ОбщаяСуммаКорректировки <> 0 Тогда
				Движение = Движения.Международный.Добавить();
				Движение.Период = Дата;
				Движение.СчетДт = ТекСтрокаОсновныеСредства.СчетДоходовРасходов;
				Движение.СчетКт = УчетнаяПолитика.СчетВыбытияОС;
				Движение.Организация = Организация;
				Движение.Сумма = ОбщаяСуммаКорректировки;
				Движение.Содержание = "Списание остаточной стоимости";
				Движение.НомерЖурнала = "Рег";
				// is ЯннуровВФ нач 20140602 ЗР-0И-001239
				Если Движение.СчетДт.Количественный Тогда 
					Движение.КоличествоДт = 1;
				КонецЕсли;
				Если Движение.СчетКт.Количественный Тогда 
					Движение.КоличествоКт = 1;
				КонецЕсли;
				// is ЯннуровВФ кон 20140602
				
				Для Ном = 1 по Движение.СчетДт.ВидыСубконто.Количество() Цикл
					Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = ТекСтрокаОсновныеСредства["Субконто" + Ном];
				КонецЦикла;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;
		
		//// Проверяем если вместе с подготовкой к выбытию было и само выбытие
		//СчетаОС = Новый Массив();
		//СчетаОС.Добавить(ПланыСчетов.Международный.ОсновныеСредства); //101
		//СчетаОС.Добавить(ПланыСчетов.Международный.ИнвестиционнаяСобственностьНетто); //102
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//			   |	МеждународныйОбороты.Субконто1 КАК ОС,
		//			   |	СУММА(МеждународныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
		//			   |	МеждународныйОбороты.КорСчет
		//			   |ИЗ
		//			   |	РегистрБухгалтерии.Международный.Обороты(&НачалоПериода, &КонецПериода, Период, Счет В ИЕРАРХИИ (&Счет), &ОС, Организация = &Организация, НЕ(КорСчет В ИЕРАРХИИ (&СчетаОС)), ) КАК МеждународныйОбороты
		//			   |
		//			   |ГДЕ
		//			   |	МеждународныйОбороты.Субконто1 = &ОсновноеСредство
		//			   |
		//			   |СГРУППИРОВАТЬ ПО
		//			   |	МеждународныйОбороты.Субконто1,
		//			   |	МеждународныйОбороты.КорСчет";
		//
		//Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		//Запрос.УстановитьПараметр("КонецПериода", ПериодКонец);
		//Запрос.УстановитьПараметр("Счет", ПланыСчетов.Международный.ОсновныеСредстваДляПродажи);
		//Запрос.УстановитьПараметр("ОС", ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
		//Запрос.УстановитьПараметр("Организация", Организация);
		//Запрос.УстановитьПараметр("СчетаОС", СчетаОС);
		//Запрос.УстановитьПараметр("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство);

		//Результат = Запрос.Выполнить();
		//Выборка = Результат.Выбрать();
		//
		//Если Выборка.Следующий() Тогда // Если были операции, связанные с выбытием.
		//	ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета;
		//	
		//	БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		//	БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.ОсновныеСредстваДляПродажи, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
		//	СуммаДт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", ПланыСчетов.Международный.ОсновныеСредстваДляПродажи, ТекСтрокаОсновныеСредства.ОсновноеСредство) - БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.ОсновныеСредстваДляПродажи, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		//	Если (СуммаДт + ОбщаяСуммаКорректировки) <> 0 Тогда // Если есть остаток по 201 с учетом предыдущей корретировки, то списываем его
		//		Движение = Движения.Международный.Добавить();
		//		Движение.Период = Дата;
		//		Движение.СчетДт = Выборка.КорСчет;
		//		Движение.СчетКт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
		//		Движение.Организация = Организация;
		//		Движение.Сумма = СуммаДт + ОбщаяСуммаКорректировки;
		//		Движение.Содержание = "Выбытие основного средства";
		//		Движение.НомерЖурнала = "Рег";
		//		
		//		Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
		//			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		//		КонецЕсли;
		//		
		//		Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
		//			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		//		КонецЕсли;
		//		
		//		// Списываем резерв переоценки
		//		БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		//		БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
		//		СуммаСписания = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		//		Если СуммаСписания <> 0 Тогда
		//			Движение = Движения.Международный.Добавить();
		//			Движение.Период = Дата;
		//			Движение.СчетДт = ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС; //30271
		//			Движение.СчетКт = ПланыСчетов.Международный.НераспределеннаяПрибыль; //304
		//			Движение.Организация = Организация;
		//			Движение.Сумма = СуммаСписания;
		//			Движение.Содержание = "Списание резерва";
		//			Движение.НомерЖурнала = "Рег";
		//			
		//			Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
		//				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//
		//// Проверяем, был ли резерв переоценки по данному ОС
		//БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		//БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
		//СуммаКт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ТекСтрокаОсновныеСредства.ОсновноеСредство) - БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		//
		//Если СуммаКт <> 0 Тогда
		//	Движение = Движения.Международный.Добавить();
		//	Движение.Период = Дата;
		//	Движение.СчетДт = ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС;
		//	Движение.СчетКт = ПланыСчетов.Международный.НераспределеннаяПрибыль;
		//	Движение.Организация = Организация;
		//	Движение.Сумма = СуммаКт;
		//	Движение.Содержание = "Закрытие резерва переоценки основного средства";
		//	Движение.НомерЖурнала = "Рег";
		//	
		//	Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
		//		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		//	КонецЕсли;
		//	
		//	Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
		//		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		//	КонецЕсли;
		//КонецЕсли;
		//конец изменений ДС МСФО 09.12.2013
	КонецЦикла;
	
	// записываем движения регистров
	Движения.ОсновныеСредстваМеждународныйУчет.Записать();
	Движения.Международный.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;


	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью
